qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal_esmc.c
  }
  else
  {
    /* DMA Abort called due to a transfer error interrupt */
    /* Change state of ESMC */
    hesmc->State = HAL_ESMC_STATE_READY;

    /* Error callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
    hesmc->ErrorCallback(hesmc);
#else
    HAL_ESMC_ErrorCallback(hesmc);
#endif
  }
}

/**
  * @brief  Wait for a flag state until timeout.
  * @param  hesmc ESMC handle
  * @param  Flag Flag checked
  * @param  State Value of the flag expected
  * @param  tickstart Start tick value
  * @param  Timeout Duration of the time out
  * @retval HAL status
  */
static HAL_StatusTypeDef ESMC_WaitFlagStateUntilTimeout(ESMC_HandleTypeDef *hesmc, uint32_t Flag,
    FlagStatus State, uint32_t tickstart, uint32_t Timeout)
{
  /* Wait until flag is in expected state */
  while((__HAL_ESMC_GET_FLAG(hesmc, Flag)) != State)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
      {
        hesmc->State     = HAL_ESMC_STATE_ERROR;
        hesmc->ErrorCode |= HAL_ESMC_ERROR_TIMEOUT;

        return HAL_ERROR;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Configure the communication registers.
  * @param  hesmc ESMC handle
  * @param  cmd structure that contains the command configuration information
  * @param  FunctionalMode functional mode to configured
  *           This parameter can be one of the following values:
  *            @arg ESMC_FUNCTIONAL_MODE_WRITE: write mode
  *            @arg ESMC_FUNCTIONAL_MODE_READ: read mode
  * @retval None
  */
static void ESMC_Config(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd, uint32_t FunctionalMode)
{
  uint32_t TmpSOCR = 0;
  uint32_t TmpDCR = 0;
  uint32_t TmpADDR24 = 0;
  uint32_t TmpADDR32 = 0;

  assert_param(IS_ESMC_FUNCTIONAL_MODE(FunctionalMode));

  if (FunctionalMode == ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT)
  {
    TmpSOCR = hesmc->Instance->SOCR;

    /* configure slave select output */
    __HAL_ESMC_SET_SSXO(hesmc,cmd->CSPinSel);

    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpSOCR, (ESMC_SOCR_SPIMODE | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRCMD | ESMC_SOCR_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));
    if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
    {
      SET_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
    } else
    {
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
    }

    /* write config values to register */
    WRITE_REG(hesmc->Instance->SOCR, TmpSOCR);

    /*Make sure the command can be sent*/
    CLEAR_BIT(hesmc->Instance->DCR, ESMC_DCR_NOCMD);

    /* configure command value */
    WRITE_REG(hesmc->Instance->SFCR, cmd->Instruction);

  }	else if (FunctionalMode == ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE)
  {
    TmpSOCR = hesmc->Instance->SOCR;
    TmpDCR  = hesmc->Instance->DCR;
    TmpADDR24 = hesmc->Instance->ADDR24;
    TmpADDR32 = hesmc->Instance->ADDR32;

    /* configure slave select output */
    MODIFY_REG(TmpADDR32, ESMC_ADDR32_SS, (cmd->CSPinSel) << ESMC_ADDR32_SS_Pos);

    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpSOCR, (ESMC_SOCR_SPIMODE | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRCMD | ESMC_SOCR_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));

    /* config command region */
    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      CLEAR_BIT(TmpDCR, ESMC_DCR_NOCMD);

      if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
      {
        SET_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      } else
      {
        CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      }
      /* set command value */
      MODIFY_REG(TmpADDR24, ESMC_ADDR24_INS, (uint8_t)cmd->Instruction);
    } else
    {
      /* Omit instruction and begin with Address */
      SET_BIT(TmpDCR, ESMC_DCR_NOCMD);
    }

    /* config address region */
    if (cmd->AddressMode != ESMC_ADDRESS_NONE)
    {
      CLEAR_BIT(TmpDCR, ESMC_DCR_NOADDR);
      if ((cmd->AddressMode == ESMC_ADDRESS_MULTI_LINES) || \
          (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES))
      {
        SET_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
      } else
      {
        CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
      }
      /* set address value */
      if (cmd->AddressSize == ESMC_ADDRESS_32_BITS)
      {
        MODIFY_REG(TmpADDR32, ESMC_ADDR32_ADDR3, ((cmd->Address >> 24) & 0x000000FF));
      }
      MODIFY_REG(TmpADDR24, (ESMC_ADDR24_ADDR0 | ESMC_ADDR24_ADDR1 | ESMC_ADDR24_ADDR2), \
                 ((cmd->Address & 0x00FFFFFF) << ESMC_ADDR24_ADDR0_Pos));
      /* set address size */
      MODIFY_REG(hesmc->Instance->CR3, (ESMC_CR3_ADDR8BIT | ESMC_CR3_ADDR16BIT | ESMC_CR3_ADDR32BIT), cmd->AddressSize);
    } else
    {
      /* Do not send out ADDRESS bytes */
      SET_BIT(TmpDCR, ESMC_DCR_NOADDR);
    }

    /* config alternate region */
    if (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_ENABLE)
    {
      /* configure alternate byte */
      MODIFY_REG(TmpADDR32, ESMC_ADDR32_MREG, cmd->AlternateByte);
      SET_BIT(TmpSOCR, ESMC_SOCR_SENM);
    } else
    {
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_SENM);
    }

    /* config dummy region */
    MODIFY_REG(TmpDCR, ESMC_DCR_DUMMY, cmd->DummyCycles);

    /* config data region */
    if ((cmd->DataMode == ESMC_DATA_WRITE) && (cmd->NbData != 0))
    {
      /* set write mode */
      CLEAR_BIT(TmpDCR, ESMC_DCR_REC);
      if (cmd->NbData > HAL_ESMC_TCR_MAX_LENGTH)
      {
        /* Read/write of undefined number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->TCR, 0);

        hesmc->Contex = ESMC_CONTEXT_WRITE_VARIABLE_LENGTH;
      } else
      {
        /* Read/write specified number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->TCR, cmd->NbData);

        hesmc->Contex = ESMC_CONTEXT_WRITE_FIXED_LENGTH;
      }

      /* Configure counters and size of the handle */
      hesmc->TxXferCount = cmd->NbData;
      hesmc->TxXferSize  = cmd->NbData;
    } else if ((cmd->DataMode == ESMC_DATA_READ) && (cmd->NbData != 0))
    {
      /* set read mode */
      SET_BIT(TmpDCR, ESMC_DCR_REC);
      if (cmd->NbData > HAL_ESMC_TCR_MAX_LENGTH)
      {
        /* Read/write of undefined number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->TCR, 0);

        hesmc->Contex = ESMC_CONTEXT_READ_VARIABLE_LENGTH;
      } else
      {
        /* Read/write specified number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->TCR, cmd->NbData);

        hesmc->Contex = ESMC_CONTEXT_READ_FIXED_LENGTH;
      }

      /* Configure counters and size of the handle */
      hesmc->RxXferCount = cmd->NbData;
      hesmc->RxXferSize  = cmd->NbData;
    } else
    {
      CLEAR_BIT(TmpDCR, ESMC_DCR_REC);

